Dlubal.RFEM5.SurfaceSupport
Surface support parameters

Dlubal.RFEM5.SurfaceSupport.No
Number

Dlubal.RFEM5.SurfaceSupport.ID
Identifier

Dlubal.RFEM5.SurfaceSupport.Comment
Comment

Dlubal.RFEM5.SurfaceSupport.Tag
Tag

Dlubal.RFEM5.SurfaceSupport.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.SurfaceSupport.SurfaceList
List of surfaces numbers supported by this support

Dlubal.RFEM5.SurfaceSupport.UseSoilin
Calculation of spring constants automatically with add-on module RF-SOILIN

Dlubal.RFEM5.SurfaceSupport.SupportConstantX
Support spring constant Cu,x

Dlubal.RFEM5.SurfaceSupport.SupportConstantY
Support spring constant Cu,y

Dlubal.RFEM5.SurfaceSupport.SupportConstantZ
Support spring constant Cu,z

Dlubal.RFEM5.SurfaceSupport.ShearConstantXZ
Shear spring constant Cv,xz

Dlubal.RFEM5.SurfaceSupport.ShearConstantYZ
Shear spring constant Cv,yz

Dlubal.RFEM5.SurfaceSupport.SupportNonlinearityZ
Nonlinearity in uZ'